# AnytimeYOLO — GELAN-m with 5 early exit detection heads (full paper architecture)
# Based on gelan-m.yaml, backbone unchanged. 5 multi-scale DDetect heads at
# progressively deeper FPN computation stages = 15 sub-exits total
# (5 main exits × 3 scales/sub-exits per exit, per paper §3-4).
#
# Computation depth (max layer that must execute before exit fires):
#   Exit 0 [4, 6, 8]    — layer 8   — backbone only, no FPN
#   Exit 1 [4, 6, 9]    — layer 9   — + SPPELAN on P5
#   Exit 2 [15, 12, 9]  — layer 15  — + top-down FPN (P3 final, P4 partial)
#   Exit 3 [15, 18, 9]  — layer 18  — + P4 bottom-up
#   Exit 4 [15, 18, 21] — layer 21  — full FPN (final)
#
# Use with EarlyExitModel + EarlyExitLoss (early_exit/model.py, early_exit/loss.py)

nc: 80
depth_multiple: 1.0
width_multiple: 1.0

anchors: 3

backbone:
  [
   [-1, 1, Conv, [32, 3, 2]],                # 0-P1/2
   [-1, 1, Conv, [64, 3, 2]],                # 1-P2/4
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]], # 2
   [-1, 1, AConv, [240]],                    # 3-P3/8
   [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]], # 4  ← E0/E1 P3 (240ch)
   [-1, 1, AConv, [360]],                    # 5-P4/16
   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]], # 6  ← E0/E1 P4 (360ch)
   [-1, 1, AConv, [480]],                    # 7-P5/32
   [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]], # 8  ← E0 P5 (480ch)
  ]

head:
  [
   [-1, 1, SPPELAN, [480, 240]],             # 9   ← E1/E2/E3 P5 (480ch)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],                # 11 cat backbone P4

   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]], # 12  ← E2 P4 (360ch)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],                # 14 cat backbone P3

   [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]], # 15  ← E2/E3/E4 P3 (240ch)

   [-1, 1, AConv, [180]],
   [[-1, 12], 1, Concat, [1]],               # 17 cat head P4

   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]], # 18  ← E3/E4 P4 (360ch)

   [-1, 1, AConv, [240]],
   [[-1, 9], 1, Concat, [1]],                # 20 cat head P5

   [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]], # 21  ← E4 P5 (480ch)

   # --- early exit heads (multi-scale DDetect, 3 sub-exits each) ---
   [[4,  6,  8],  1, DDetect, [nc]],         # 22  E0: backbone only
   [[4,  6,  9],  1, DDetect, [nc]],         # 23  E1: + SPPELAN
   [[15, 12, 9],  1, DDetect, [nc]],         # 24  E2: + top-down FPN
   [[15, 18, 9],  1, DDetect, [nc]],         # 25  E3: + P4 bottom-up
   [[15, 18, 21], 1, DDetect, [nc]],         # 26  E4: full FPN (final)
  ]
