# AnytimeYOLO — GELAN-m with 3 early exit detection heads
# Based on gelan-m.yaml, backbone unchanged, head adds 2 early exits before final.
#
# Exit 0 [4,6,8]    — backbone scales, no FPN merge   (earliest, lowest AP)
# Exit 1 [15,12,9]  — partial FPN: P3 done, P4/P5 partial
# Exit 2 [15,18,21] — full FPN                         (final, highest AP)
#
# Use with EarlyExitModel + EarlyExitLoss (early_exit/model.py, early_exit/loss.py)

nc: 80
depth_multiple: 1.0
width_multiple: 1.0

anchors: 3

backbone:
  [
   [-1, 1, Conv, [32, 3, 2]],               # 0-P1/2
   [-1, 1, Conv, [64, 3, 2]],               # 1-P2/4
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]], # 2
   [-1, 1, AConv, [240]],                   # 3-P3/8
   [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]], # 4  ← exit 0 P3 (240ch)
   [-1, 1, AConv, [360]],                   # 5-P4/16
   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]], # 6  ← exit 0 P4 (360ch)
   [-1, 1, AConv, [480]],                   # 7-P5/32
   [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]], # 8  ← exit 0 P5 (480ch)
  ]

head:
  [
   [-1, 1, SPPELAN, [480, 240]],            # 9   ← exit 1 P5 (480ch)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],              # 11 cat backbone P4

   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]], # 12  ← exit 1 P4 (360ch)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],              # 14 cat backbone P3

   [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]], # 15  ← exit 1 P3 / exit 2 P3 (240ch)

   [-1, 1, AConv, [180]],
   [[-1, 12], 1, Concat, [1]],             # 17 cat head P4

   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]], # 18  ← exit 2 P4 (360ch)

   [-1, 1, AConv, [240]],
   [[-1, 9], 1, Concat, [1]],              # 20 cat head P5

   [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]], # 21  ← exit 2 P5 (480ch)

   # --- early exit heads ---
   [[4, 6, 8],    1, DDetect, [nc]],       # 22  exit 0: backbone P3/P4/P5
   [[15, 12, 9],  1, DDetect, [nc]],       # 23  exit 1: partial FPN (P3→P5)
   [[15, 18, 21], 1, DDetect, [nc]],       # 24  exit 2: full FPN (final)
  ]
